akywong/mwstation/STM32_USER/main.c
/*  main.c  */
#include "sys.h"
#include "stm32f10x_flash.h"
#include "delay.h"
#include "serial_rtx.h"
#include "usart.h"
#include "led.h"
//#include "w25qxx.h"
#include "string.h"
//#include "ff.h"
//#include "sdio_sdcard.h"
#include "rtc.h"
#include "timer.h"
#include "spi.h"
//#include "key.h"
#include "24cxx.h"
//#include "adc.h"
#include "lps22hb.h"
#include "bsp_ads1256.h"
#include "iwdg.h"
//#include "hyt939.h"
#include "ADS1220.h"
#include "ads1248.h"
#include "io.h"
#include "utils.h"
#include "as3935.h"
#include "bsp_ads1256.h"
#include "pcap.h"
#include "sht3x.h"
#include "main.h"

float Rref = 3240.0;
float FlashGainCorrection;

float DacErrorCorrection = 0.99945;
float MeasuredGainCodeValue = 7868944.1883;
unsigned char StartConversion;


uint8_t new_file_flag = 0;
uint32_t new_record_count = 0;

uint8_t send_cmd[12] = {0x24,0x30,0x31,0x2C,0x57,0x56,0x3F,0x2A,0x2F,0x2F,0x0D,0x0A};//$01,WV?*//<cr><lf>
uint8_t send_htset_cmd[13] ={0x24,0x30,0x31,0x2C,0x48,0x54,0x39,0x39,0x2A,0x2F,0x2F,0x0D,0x0A};//$01,HT99*//<cr><lf>
uint8_t send_htq_cmd[12]={0x24,0x30,0x31,0x2C,0x48,0x54,0x3F,0x2A,0x2F,0x2F,0x0D,0x0A};//$01,HT?*//<cr><lf>

uint16_t record_interval[6]={1,1,10,60,600,3600};

struct record_info{
	float wind_speed;
	float wind_direction;
	uint32_t wind_count;
	float temperature;
	float humidity;
	uint32_t sensor_count;
	float pressure;
	uint32_t press_count;
	double ADC_value0;
	double ADC_value1;
	double ADC_value2;
	double ADC_value3;
	uint32_t ADC_count;
	u8 flag;
};
struct record_info record;
struct record_info record_old;
struct record_info record_last;

//
struct sys_status status;
struct sys_config config_r,config_t;
struct wind_info  wind;
//struct fs_status cur;
//struct bme280_dev dev;
//struct bme280_data comp_data;
float pressure;
double temperature;
double humidity;

float ads1220_temperature;

//struct sys_config test_config;
char *check_wind_info(char *str, int len);
void record_file_write(void);
//void record_head(void);
uint32_t check_config(uint8_t *data);
uint32_t check_cmd(uint8_t *data);
uint8_t check_between(int min, int max, float data);
uint8_t check_wind_speed(float speed);
uint8_t check_wind_direction(float direction);
uint8_t check_temperature(float temp);
uint8_t check_pressure(float pressure);
uint8_t check_humidity(float humidity);
uint8_t check_record(struct record_info r);
uint8_t pack_data(uint8_t *data,struct record_info r);
void pack_ht_data(void *buf,uint8_t flag);

#define UART_DELAY  12
void RS485_send_data(void *buf,uint8_t len);
int main(void)
{
	//u8 t=0,r=0;
	volatile static unsigned char tempData[3];
	unsigned char calibrateCount = 0;
	
	//memset(&cur, 0, sizeof(struct fs_status));
	memset(&status, 0, sizeof(struct sys_status));
	memset(&wind, 0,sizeof(struct wind_info));
	memset(&record, 0, sizeof(record));
	memset(&record_old, 0, sizeof(record_old));
	memset(&record_old, 0, sizeof(record_last));
	memset(&config_r,0,sizeof(config_r));
	memset(&config_t,0,sizeof(config_t));
	
	delay_init();	    //延时函数初始化
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//设置中断优先级分组为组2：2位抢占优先级，2位响应优先级
	TIM_SetInterval(1,2000);//1ms
	//LED_Init();
	//Key_Init();
	IO_Init();
	//SPI1_Init();
	SPI2_Init();
	AT24CXX_Init();
	if(0){
		Thunder_Init();
	}
	if(0){
		float pressure;
		USART1_Init(115200); //串口1初始化
	  USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);
		if(lps22hb_init()){
			LED_ON(LED1);
		}
		while(1){
			if(0 == lps22hb_get_pressure(&pressure)){
				printf("pressure %f Pa\n",pressure);
			}
			delay_ms(1000);
		}
	}
	
	if(0){
		etError err;
		float temperature=0.0;
		float humidity=0.0;
		USART1_Init(115200); //串口1初始化
	  USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);
		SHT3X_Init(0x44);
		if(1){
			u32t      serialNumber;// serial number
			delay_ms(50);
			err = SHT3x_ReadSerialNumber(&serialNumber);
			if(err != NO_ERROR){
			} // do error handling here
			printf("serial num :%ld\n",serialNumber);
		}
		while(1){
			if(NO_ERROR == SHT3X_GetTempAndHumi(&temperature, &humidity, REPEATAB_HIGH, MODE_CLKSTRETCH, 50)){
			//if(NO_ERROR == SHT3X_GetTempAndHumi(&temperature, &humidity, REPEATAB_HIGH, MODE_POLLING, 50)){
				printf("temperature %f,humidity %f%%\n",temperature,humidity);
			}
			delay_ms(1000);
		}
	}
	
	if(0){
		uint8_t gain = ADS1256_GAIN_8;
		USART1_Init(115200); //串口1初始化
	  USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);
		bsp_InitADS1256();
		if(1){
			uint8_t id = ADS1256_ReadChipID();
			printf("ads1256 id = %d\n",id);
		}
		ADS1256_CfgADC((ADS1256_GAIN_E)gain, ADS1256_5SPS);
		ADS1256_StartScan(1);	
		while(1){
			delay_ms(500);
			printf("channel 1 :%f\n",(((double)ADS1256_GetAdc(0)) * 2.5000000) / 4194303.0/(double)(1<<gain));
			printf("channel 2 :%f\n",(((double)ADS1256_GetAdc(1)) * 2.5000000) / 4194303.0/(double)(1<<gain));
			printf("channel 3 :%f\n",(((double)ADS1256_GetAdc(2)) * 2.5000000) / 4194303.0/(double)(1<<gain));
			printf("channel 4 :%f\n",(((double)ADS1256_GetAdc(3)) * 2.5000000) / 4194303.0/(double)(1<<gain));
			printf("channel 5 :%f\n",(((double)ADS1256_GetAdc(4)) * 2.5000000) / 4194303.0/(double)(1<<gain));
			
			if(ADS1256_GetAdc(8)) {
				printf(" ADS1256 RESET\r\n");
				ADS1256_CfgADC(ADS1256_GAIN_64, ADS1256_5SPS);
				ADS1256_StartScan(1);	
			}
		}
		return 0;
	}
	if(0){
		uint8_t ret;
		USART1_Init(115200); //串口1初始化
	  USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);
		ADS1248_GPIO_Init();
		ADS1248_channel_select(2);
		ADS1248SetChannel(ADS1248_AINP4,ADS1248_AINN5);//(P,N)
		ADS1248SetVoltageReference(ADS1248_REF1);
		ADS1248SetGain(ADS1248_GAIN_8);
		ADS1248SetDataRate(ADS1248_DR_20);
		ADS1248SetCurrentDACOutput(ADS1248_IDAC_500);
		ADS1248SetDRDYMode(ADS1248_DRDY_OFF);
		ADS1248SetIDACRouting(ADS1248_IDAC1_EXT1,ADS1248_IDAC2_EXT2);
		ADS1248SetOFC(0x0);
		//ADS1248SetFSC(0x400000);
		ADS1248SetIntRef(1);
		ADS1248_SELFOCAL();
		{
			int i;
		 uint8_t data[16];
			ADS1248_dump(data);
			for(i=0;i<15;i++){
				printf("reg%2d:0x%02x\n",i,data[i]);
			}
		}
		for(;;){
			delay_ms(200);
			printf("%f\n",ADS1248_Get_Temperature());
		}
		return 0;
	}
	
	if(0){
		uint8_t write = 0xA9;
		uint8_t read=0;
		USART1_Init(115200); //串口1初始化
	  USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);
		
		PCAP_powerup_reset();
		PCAP_sram_write(0,write);
		PCAP_sram_read(0,&read);
		printf("write value 0x%x,read value 0x%x\n",write,read);
		{
			uint32_t regs[11]={0x42000F,0x201022,0x03160B,0x0D0064,0x080000,0,0x000040,0x1F0000,0x800030,0xFF000F,0x180087};
			uint32_t status;
			uint32_t rregs[11]={0};
			PCAP_config(regs);
			PCAP_partitial_reset();
			PCAP_start_cdc();
			delay_ms(600);
			PCAP_read_status(&status);
			PCAP_read_cdc(8,rregs);
			{
				int i;
				for(i=0;i<8;i++){
					printf("%d\n",rregs[i]);
				}
			}
		}
	}
	if(1){
		
		USART1_Init(115200); //串口1初始化
	  USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);
		ADS1220_Reset();

    // Determine the ADS1220 Calibration offset - Short the AIN0 and AIN1 together and measure the results 4 times.
    // The average result will be subtracted from all future measurements.
    Setup_ADS1220 (ADS1220_MUX_SHORTED, ADS1220_OP_MODE_NORMAL,
                   ADS1220_CONVERSION_SINGLE_SHOT, ADS1220_DATA_RATE_20SPS, ADS1220_GAIN_8, ADS1220_USE_PGA,
                   ADS1220_IDAC1_AIN2, ADS1220_IDAC2_DISABLED, ADS1220_IDAC_CURRENT_500_UA);//ADS1220_IDAC2_DISABLED*/
		delay_ms(500);
		
		ReadConversionData = 0;
		ads1220_int_start();
    ADS1220_Start ();    
		// Gather and average 8 readings from the ADS1220
    while (calibrateCount < 8)
    {
        while (!ReadConversionData);   // Wait for Data Ready interrupt
        ReadConversionData = 0;
        ADS1220_Get_Conversion_Data ((unsigned char *)tempData);   // Get the raw data
        ADS1220_Offset_Calibrate_Data ((unsigned char *)tempData);        // Send results to calibration function
        calibrateCount++;

