akywong/mwstation/STM32_USER/main.c
        // Start next calibration reading?
        if (calibrateCount < 8)
            ADS1220_Start ();
    }
	
		// Configure ADS1220 for actual measurements
    Setup_ADS1220 (ADS1220_MUX_AIN0_AIN1, ADS1220_OP_MODE_NORMAL,
                   ADS1220_CONVERSION_SINGLE_SHOT, ADS1220_DATA_RATE_20SPS, ADS1220_GAIN_8, ADS1220_USE_PGA,
                   ADS1220_IDAC1_AIN2, ADS1220_IDAC2_DISABLED, ADS1220_IDAC_CURRENT_500_UA);//ADS1220_IDAC2_DISABLED//ADS1220_IDAC2_AIN2
	
		delay_ms(50);
    StartConversion = 0;
    ReadConversionData = 0;
    ADS1220_Start ();      // Only one start needed for Continuous Mode
		
		while(1){
			ads1220_temperature = ADS1220_Get_Temperature();
			printf("ads1220 temperature %f℃\n",ads1220_temperature);
			ADS1220_Start ();
			delay_ms(500);
		}
		
	}
	//bsp_InitADS1256();
	
	//ADS1256_CfgADC((ADS1256_GAIN_E)3, ADS1256_5SPS);
	//ADS1256_StartScan(1);
	
	// Reset the ADS1220
    ADS1220_Reset();

    // Determine the ADS1220 Calibration offset - Short the AIN0 and AIN1 together and measure the results 4 times.
    // The average result will be subtracted from all future measurements.
    Setup_ADS1220 (ADS1220_MUX_SHORTED, ADS1220_OP_MODE_NORMAL,
                   ADS1220_CONVERSION_SINGLE_SHOT, ADS1220_DATA_RATE_20SPS, ADS1220_GAIN_8, ADS1220_USE_PGA,
                   ADS1220_IDAC1_AIN2, ADS1220_IDAC2_DISABLED, ADS1220_IDAC_CURRENT_500_UA);//ADS1220_IDAC2_DISABLED*/
	
	if(lps22hb_init()){
		LED_ON(LED1);
	}
	
	USART1_Init(115200); //串口1初始化
	USART_ITConfig(USART1, USART_IT_IDLE, ENABLE);
	USART3_Init(9600); //串口3初始化
	USART_ITConfig(USART3, USART_IT_IDLE, ENABLE);
	
	
	{
		config_t.head = 0xAA;
		config_t.tail = 0xAA;
		config_t.type = 0x01;
		config_t.freq = 1;
		config_t.heat_flag = 0;
		config_t.crc = CRC_calCrc8((const unsigned char *)(&config_t), sizeof(config_t)-2);
		USART_SendBuf(USART3,(unsigned char*)&config_t,sizeof(config_t));
	}
	
	while(AT24CXX_Check())
	{
		delay_ms(500);
		printf("EEPROM Check Failed!\r\n");
	}
	delay_ms(1000);
	if(usart3_recv_frame_flag && check_config((uint8_t *)usart3_recv)){
			memcpy(&config_r,usart3_recv,sizeof(config_r));
			AT24CXX_Write(0,(u8*)&config_r,sizeof(config_r));
	} else {
			AT24CXX_Read(0,(u8*)&config_r,sizeof(config_r));
			if(0 == check_config((uint8_t *)&config_r)) {
				config_r.freq = 1;
				config_r.head = 0xAA;
				config_r.tail = 0xAA;
				config_r.heat_flag = 0;
				config_r.crc = CRC_calCrc8((const unsigned char *)(&config_r), sizeof(config_r)-2);
			}
	}
	usart1_recv_frame_flag = 0;
	/*if(CONFIG_IO_GET_IN()) {
		while(1) {
			if(usart1_recv_frame_flag) {
				sscanf((char*)usart1_recv, "$%d,%d,%d,%d,%d:%d:%d,%d",&config.baud,
					&config.year,&config.month,&config.date,&config.hour,&config.minute,&config.second,&config.freq);
				usart1_recv_frame_flag = 0;
				if(config.year == 0) {
					status.rtc_flag =0;
				} else {
					status.rtc_flag = 1;
				}
				USART_SendString(USART1,usart1_recv);
				config.head = 0xAA5555AA;
				config.tail = 0xAA5555AA;
				AT24CXX_Write(0,(u8*)&config,sizeof(config));
				//AT24CXX_Read(0,(u8*)&test_config,sizeof(config));
				break;
			}
			delay_ms(50);
		}
	} else {	
		AT24CXX_Read(0,(u8*)&config,sizeof(config));
		if((config.head != 0xAA5555AA) || (config.tail != 0xAA5555AA)){
			config.head = 0xAA5555AA;
			config.tail = 0xAA5555AA;
			config.baud = 9600;
			config.year = 2019;
			config.month = 16;
			config.date = 8;
			config.hour = 0;
			config.minute = 0;
			config.second = 0;
			config.freq = 1;
			AT24CXX_Write(0,(u8*)&config,sizeof(config));
		}
		status.rtc_flag = 1;
	}*/
	//printf("usart2 baud : %d\r\n",config.baud);
	//printf("freq : %d\r\n",config.freq);
	
	/*while(RTC_Init(status.rtc_flag,config.year,config.month,config.date,config.hour,config.minute,config.second)) {*/
	while(RTC_Init(1,2020,1,1,0,0,0)) {
		delay_ms(100);
	}
	
	
	//lps22hb_init(&dev);
	
	//HYT939_Measure_Request();
	
	status.cmd_send_flag = 1;
	
	//Start:
	//开始初始化SD卡
	/*
	while( SD_OK != SD_Init() ){
		delay_ms(30);
		t++;
		if(t>30){
			t=0;
		}
	}
	cur.sd_cap = (u32)(SDCardInfo.CardCapacity/1024/1024);
	
	delay_ms(500);
	
	//开始初始化文件系统
	while(FR_OK != f_mount(&cur.fs,"0:",1)){
		delay_ms(30);
		t++;
		if(t>30){
			t=0;
		}
	}
	
	delay_ms(100);
	
	//开始创建文件
	snprintf(cur.fpath,32,"%04d-%02d-%02d.txt",
													calendar.w_year,calendar.w_month,calendar.w_date);
	r=f_open(&cur.fsrc,cur.fpath,FA_OPEN_ALWAYS|FA_WRITE);
	if(FR_OK != r){
		//printf("\r\n创建文件失败 !\r\n");
		//goto Start;
	}
	//f_stat(cur.fpath, &cur.finfo);
	//f_lseek(&cur.fsrc,cur.finfo.fsize);
	f_lseek(&cur.fsrc,cur.fsrc.fsize);
	cur.line_num = 0;
	cur.file_flag = 1;
	//printf("usart2 baud : %d\r\n",config.baud);
	//printf("freq : %d\r\n",config.freq);
	if(cur.fsrc.fsize == 0){
		LED_ON(LED0);
		record_head();
		LED_OFF(LED0);
	}*/
	
		ReadConversionData = 0;
		ads1220_int_start();
    ADS1220_Start ();             // Kick off conversion

    // Gather and average 8 readings from the ADS1220
    while (calibrateCount < 8)
    {
        while (!ReadConversionData);   // Wait for Data Ready interrupt
        ReadConversionData = 0;
        ADS1220_Get_Conversion_Data ((unsigned char *)tempData);   // Get the raw data
        ADS1220_Offset_Calibrate_Data ((unsigned char *)tempData);        // Send results to calibration function
        calibrateCount++;

        // Start next calibration reading?
        if (calibrateCount < 8)
            ADS1220_Start ();
    }
	
		// Configure ADS1220 for actual measurements
    Setup_ADS1220 (ADS1220_MUX_AIN0_AIN1, ADS1220_OP_MODE_NORMAL,
                   ADS1220_CONVERSION_SINGLE_SHOT, ADS1220_DATA_RATE_20SPS, ADS1220_GAIN_8, ADS1220_USE_PGA,
                   ADS1220_IDAC1_AIN2, ADS1220_IDAC2_DISABLED, ADS1220_IDAC_CURRENT_500_UA);//ADS1220_IDAC2_DISABLED//ADS1220_IDAC2_AIN2
	
		delay_ms(50);
    StartConversion = 0;
    ReadConversionData = 0;
    ADS1220_Start ();      // Only one start needed for Continuous Mode
	
	USART2_Init(9600); //串口2初始化
	USART_ITConfig(USART2, USART_IT_IDLE, ENABLE);
	//HYT939_Measure_Request();
	IWDG_Init_2s();
	pack_ht_data(send_htset_cmd,config_r.heat_flag);
	RS485_send_data(send_htset_cmd,13);
	while(1)
	{
		IWDG_Feed();
		/*if(new_file_flag == 1) {
			f_close(&cur.fsrc);
			new_file_flag = 0;
			snprintf(cur.fpath,32,"%04d-%02d-%02d.txt",
													calendar.w_year,calendar.w_month,calendar.w_date);
			r=f_open(&cur.fsrc,cur.fpath,FA_OPEN_ALWAYS|FA_WRITE);
			if(FR_OK != r){
			}
			//f_stat(cur.fpath, &cur.finfo);
			//f_lseek(&cur.fsrc,cur.finfo.fsize);
			//printf("\r\n创建文件成功 !\r\n");
			f_lseek(&cur.fsrc,cur.fsrc.fsize);
			cur.line_num = 0;
			cur.file_flag = 1;
			if(cur.fsrc.fsize == 0){
				record_head();
			}
		}*/
		if(usart3_recv_frame_flag){
			usart3_recv_frame_flag = 0;
			if(check_config((uint8_t *)usart3_recv)){
				memcpy(&config_r,usart3_recv,sizeof(config_r));
				status.ht_exp= 1;
				AT24CXX_Write(0,(u8*)&config_r,sizeof(config_r));
			}else if(check_cmd((uint8_t *)usart3_recv)){
				uint8_t uart_data[64];
				if(pack_data(uart_data,record_last)){
					USART_SendBuf(USART3,uart_data,25);
				}
			}
		}
		IWDG_Feed();
		//记录风速计信息
		if(usart2_recv_frame_flag) {
				wind.info_str = check_wind_info((char*)usart2_recv, usart2_recv_cnt);
				if(wind.info_str != NULL) {
					if(strstr((char*)usart2_recv,"$WI,WVP=") == (char*)usart2_recv) {
						sscanf(wind.info_str,"%f,%f,%d",&wind.speed, &wind.direction,&wind.status);
						if(check_wind_speed(wind.speed) && check_wind_direction(wind.direction)) {
							record.wind_speed += wind.speed;
							record.wind_direction += wind.direction;
							record_last.wind_speed = wind.speed;
							record_last.wind_direction = wind.direction;
							record.wind_count++;
							status.last_wind_info = tick_count;
						}
					}else if(strstr((char*)usart2_recv,"$WI,HT=") == (char*)usart2_recv){
						sscanf(wind.info_str,"%d,",&wind.ht);
						if(wind.ht == 99){
							wind.ht_flag = 0;
						}else if(wind.ht == FT742_HT_TEMP){
							wind.ht_flag = 1;
						} else {
							wind.ht_flag = 2;
						}
						if(wind.ht_flag != config_r.heat_flag) {
							pack_ht_data(send_htset_cmd,config_r.heat_flag);
							RS485_send_data(send_htset_cmd,13);
							status.last_ht_cmd_tick = tick_count;
						}
					}
				}
        usart2_recv_frame_flag = 0;
        usart2_recv_cnt = 0;
        memset(usart2_recv,0,32);
    } 
		if (0 == usart2_recv_flag){
			if(status.cmd_send_flag){
				if(((tick_count - status.last_cmd_tick) > 400) && ((tick_count - status.last_ht_cmd_tick)>400)){
					RS485_send_data(send_cmd,12);
          status.last_cmd_tick = tick_count;
        }
			}
			if(((tick_count - status.last_cmd_tick) > 400) && ((status.ht_exp==1) || ((tick_count - status.last_ht_cmd_tick)>5000))){
					status.ht_exp =0;
					RS485_send_data(send_htq_cmd,12);
          status.last_ht_cmd_tick = tick_count;
      }
    }
		IWDG_Feed();
		//记录气压计信息
		if(((tick_count - status.last_press) >400) || (tick_count < status.last_press)) {
			status.last_press = tick_count;
			if(0 == lps22hb_get_pressure(&pressure)){
				if(check_pressure(pressure)) {
					record.pressure += pressure;
					record_last.pressure = pressure;
					record.press_count++;
				}
			}
		}
		IWDG_Feed();
		//记录温湿度计信息
		if(((tick_count - status.last_sensor) >400) || (tick_count < status.last_sensor)) {
			status.last_sensor = tick_count;
			/*if(0==HYT939_Data_Fetch(&humidity,&temperature)) {
				if(check_humidity(humidity) && check_temperature(temperature)) {
					record.humidity += humidity;
					record.temperature += temperature;
					record_last.humidity = humidity;
					record_last.temperature = temperature;
					record.sensor_count++;
				}
			}
			HYT939_Measure_Request();*/
		}
		IWDG_Feed();
		//??AD????
		if(((tick_count - status.last_adc) > 400) || (tick_count < status.last_adc)) {
			status.last_adc = tick_count;
			record.ADC_value0 += (double)ADS1256_GetAdc(0);
			record.ADC_value1 += (double)ADS1256_GetAdc(1);
			record.ADC_value2 += (double)ADS1256_GetAdc(2);
			record.ADC_value3 += (double)ADS1256_GetAdc(3);
			record.ADC_count++;
			if(ADS1256_GetAdc(8)) {
				//USART_SendString(USART1," ADS1256 RESET\r\n");
				ADS1256_CfgADC((ADS1256_GAIN_E)config_r.ad_gain, ADS1256_5SPS);
				ADS1256_StartScan(1);	
			}
		}
		IWDG_Feed();
		if(ReadConversionData){
			ReadConversionData = 0;
			ads1220_temperature = ADS1220_Get_Temperature();
			ADS1220_Start ();
		}
		
		
		//写文件
		IWDG_Feed();
		if(((new_record_count - status.last_record_tick) >= record_interval[config_r.freq]) || (new_record_count < status.last_record_tick)){
			LED_ON(LED0);
			status.last_record_tick = new_record_count;
			record_file_write();
			LED_OFF(LED0);
		}
		delay_ms(100);
	}
}
//检查风速计信息格式
char *check_wind_info(char *str, int len)
{
    int i;
    int xor_value = 0;
    int value ;
    int equal_sign=0;
    int asterisk =0;

    if(str == NULL || len>31) {
        return NULL;
    } 

    if(*str != '$' || str[len-2] != 0x0d || str[len-1] != 0x0a) {
        return NULL;
    }
    for(i=1;i<len-2;i++) {
        if(str[i] == '=') {
            equal_sign = i;
        }else if(str[i] == '*') {
            asterisk = i;
            break;
        }
        xor_value ^= str[i];
    } 
    
    if(equal_sign ==0 || asterisk == 0) {
        return NULL;
    }
    
