akywong/mwstation/STM32_USER/main.c
    sscanf(str+i+1,"%x",&value);
    if(xor_value != value) {
        return NULL;
    }
    
    return (str+equal_sign+1);
}
void pack_ht_data(void *buf,uint8_t flag)
{
	uint8_t temp=99;
	//uint8_t xor_value = 0;
	uint8_t *data=(uint8_t*)buf;
	//int i;
	if(flag!=0) {
		temp = FT742_HT_TEMP;
	}else{
		temp = 99;
	}
	data[6] = 0x30+temp/10;
	data[7] = 0x30+temp%10;
	
	/*for(i=1;i<8;i++) {
		xor_value ^= data[i];
  }
	
	data[9] = 0x30+xor_value/16;
	data[10] = 0x30+xor_value%16;*/
}
void record_file_write(void)
{
	//uint8_t valid_flag = 0;
	//UINT count;
	//u8 ret;
	int len;
	char prefix[128]={0};
	uint8_t uart_data[64]={0};
	
	if(record.press_count !=0 ){
		//record.humidity /= ((float)record.sensor_count);
		//record.temperature /= ((float)record.sensor_count);
		record.pressure /= ((float)record.press_count);
		record.flag |= 1<<2;
	}else{
		/*record.humidity = record_old.humidity;
		record.temperature = record_old.temperature;
		record.pressure = record_old.pressure;*/
	}
	if(record.sensor_count !=0 ){
		record.humidity /= ((float)record.sensor_count);
		record.temperature /= ((float)record.sensor_count);
		//record.pressure /= ((float)record.sensor_count);
		record.flag |= 3;
	}
	if(record.wind_count != 0) {
		record.wind_speed /= ((float)record.wind_count);
		record.wind_direction /= ((float)record.wind_count);
		record.flag |= 3<<3;
	}else{
		/*record.wind_speed = record_old.wind_speed;
		record.wind_direction = record_old.wind_direction;*/
	}
	len = sprintf(prefix,"\"%4d-%02d-%02d %02d:%02d:%02d\",%6.2f,%6.2f,%7.2f,%6.2f,%7.2f,%6.2f",
											calendar.w_year,calendar.w_month,calendar.w_date,calendar.hour,calendar.min,calendar.sec,
											record.wind_speed,record.wind_direction,
											record.temperature, record.humidity, record.pressure/100.0,ads1220_temperature
											);
	
	prefix[len] = 0x0d;
	prefix[len+1] = 0x0a;
	/*ret = f_write(&cur.fsrc,prefix,len+2,&count);
		if(FR_OK != ret) {
			cur.file_flag = 0;
			cur.line_num = 0;
			f_close(&cur.fsrc);//FR_OK
			return;
		} else {
			cur.line_num++;
			f_sync(&cur.fsrc);
		}*/

		//memcpy(&record_old, &record, sizeof(struct record_info));
		USART_SendString(USART1,(unsigned char *)prefix);
		if(pack_data(uart_data,record)){
			USART_SendBuf(USART3,uart_data,25);
		}
		record_old.humidity = record.humidity;
		record_old.temperature = record.temperature;
		record_old.pressure = record.pressure;
		record_old.wind_speed = record.wind_speed;
		record_old.wind_direction = record.wind_direction;
		memset(&record, 0, sizeof(record));
}

/*void record_head(void)
{
	int len;
	char str[256];
	int ret;
	UINT count;
	
	len = sprintf(str,"\"TOPFLAG\",\"小型气象站\",\"版本V1.0\",\"数据平均\"");
	str[len] = 0x0d;
	str[len+1] = 0x0a;
	len+=2;
	
	len += sprintf(str+len,"\"日期时间\",\"序号\",\"总辐射\",\"直接辐射\",\"散射辐射\",\"倾斜辐射\",\"风速\",\"风向\",\"空气温度\",\"空气湿度\",\"大气压力\"");
	str[len] = 0x0d;
	str[len+1] = 0x0a;
	len+=2;
	
	len += sprintf(str+len,"\"YYYY-MM-DD hh:mn:ss\",\"-\",\"W/m^2\",\"W/m^2\",\"W/m^2\",\"W/m^2\",\"m/s\",\"°\",\"℃\",\"%%\",\"hPa\"");
	str[len] = 0x0d;
	str[len+1] = 0x0a;
	len+=2;
	
	ret = f_write(&cur.fsrc,str,len,&count);
	if(FR_OK != ret) {
		cur.file_flag = 0;
		cur.line_num = 0;
		f_close(&cur.fsrc);
		return;
	} else {
		//cur.line_num++;
		f_sync(&cur.fsrc);
	}
}*/

uint32_t check_config(uint8_t *data)
{
	uint8_t crc=0;
	struct sys_config temp_config;
	memcpy(&temp_config,data,sizeof(temp_config));
	crc = CRC_calCrc8((const unsigned char *)data, sizeof(temp_config)-2);
	if((0x11==temp_config.type) && (crc == temp_config.crc) && (0xAA==temp_config.head) &&(0xAA==temp_config.tail)) {
		return 1;
	}else{
		return 0;
	}
}
uint32_t check_cmd(uint8_t *data)
{
	uint8_t crc = 0;
	crc = CRC_calCrc8((const unsigned char *)data, 3);
	if((data[0]==0xAA)&&(data[1]==0x12)&&(crc==data[2])&&(data[3]==0xAA)){
		return 1;
	}else{
		return 0;
	}
}

uint8_t pack_data(uint8_t *data,struct record_info r)
{
	uint8_t flag;
	flag = check_record(r);
	if(flag){
		data[0]=0xAA;
		data[1]=0x02;
		memcpy(data+2,&(r.temperature),4);
		memcpy(data+6,&(r.humidity),4);
		memcpy(data+10,&(r.pressure),4);
		memcpy(data+14,&(r.wind_speed),4);
		memcpy(data+18,&(r.wind_direction),4);
		data[22] = flag&record.flag;
		data[23] = CRC_calCrc8((const unsigned char *)data, 23);
		data[24]=0xAA;
		return 1;
	}
	return 0;
}
uint8_t check_between(int min, int max, float data)
{
	if((data>=min) && (data<=max)){
		return 1;
	}else{
		return 0;
	}
}
//检测风速
uint8_t check_wind_speed(float speed)
{
	return check_between(0,75,speed);
}
//
uint8_t check_wind_direction(float direction)
{
	return check_between(0,360,direction);
}
//
uint8_t check_temperature(float temp)
{
	return check_between(-40,80,temp);
}
//
uint8_t check_pressure(float pressure)
{
	return check_between(33000,110000,pressure);
}
//
uint8_t check_humidity(float humidity)
{
	return check_between(0,100,humidity);
}
uint8_t check_record(struct record_info r)
{
	uint8_t flag = 0;
	flag |= check_temperature(r.temperature);
	flag |= check_humidity(r.humidity)<<1;
	flag |= check_pressure(r.pressure)<<2;
	flag |= check_wind_speed(r.wind_speed)<<3;
	flag |= check_wind_direction(r.wind_direction)<<4;
	
	return flag;
	
	/*if(check_wind_speed(r.wind_speed) && check_wind_direction(r.wind_direction) && check_pressure(r.pressure) && check_humidity(r.humidity)&&check_temperature(r.temperature)){
		return 1;
	}else{
		return 0;
	}*/
}
void RS485_send_data(void *buf,uint8_t len)
{
	int i;
	uint8_t *p=(uint8_t *)buf;
	IO_ON(WINDRE);
	IO_ON(WINDDE);
	for(i=0;i<len;i++){
		while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
		USART_SendData(USART2,p[i]);
	}
	while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
	IO_OFF(WINDRE);
	IO_OFF(WINDDE);
}
